tests/AppBundle/Fixtures/Data/Stripe/customer-hascard-hassub.json

{
  "id": "{stripe-customer-id}",
  "object": "customer",
  "account_balance": 0,
  "created": 1426836911,
  "currency": "gbp",
  "default_source": "card_Bb4A2szGLfgwJe",
  "delinquent": false,
  "description": "Has card has sub",
  "discount": null,
  "email": "{stripe-customer-email}",
  "livemode": false,
  "metadata": {},
  "shipping": null,
  "sources": {
    "object": "list",
    "data": [
      {
        "id": "card_Bb4A2szGLfgwJe",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "{stripe-customer-id}",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2022,
        "fingerprint": "7y5WDQllCuyzj32D",
        "funding": "credit",
        "last4": "4242",
        "metadata": {},
        "name": null,
        "tokenization_method": null,
        "type": "Visa"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/{stripe-customer-id}/sources",
    "count": 1
  },
  "subscriptions": {
    "object": "list",
    "data": [
      {
        "id": "sub_Bb4AOCnRZzV80I",
        "object": "subscription",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1508235068,
        "current_period_end": 1510827068,
        "current_period_start": 1508235068,
        "customer": "{stripe-customer-id}",
        "discount": null,
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_0BDs2SVZJqDRzwdrOx7KJDjP",
              "object": "subscription_item",
              "created": 1508235068,
              "metadata": {},
              "plan": {
                "id": "personal-9",
                "object": "plan",
                "amount": 900,
                "created": 1370600314,
                "currency": "gbp",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "name": "Personal",
                "statement_descriptor": null,
                "trial_period_days": 30,
                "statement_description": null
              },
              "quantity": 1
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_Bb4AOCnRZzV80I",
          "count": 1
        },
        "livemode": false,
        "metadata": {},
        "plan": {
          "id": "personal-9",
          "object": "plan",
          "amount": 900,
          "created": 1370600314,
          "currency": "gbp",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "name": "Personal",
          "statement_descriptor": null,
          "trial_period_days": 30,
          "statement_description": null
        },
        "quantity": 1,
        "start": 1508235068,
        "status": "trialing",
        "tax_percent": null,
        "trial_end": 1510827068,
        "trial_start": 1508235068
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/{stripe-customer-id}/subscriptions",
    "count": 1
  },
  "cards": {
    "object": "list",
    "data": [
      {
        "id": "card_Bb4A2szGLfgwJe",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "{stripe-customer-id}",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2022,
        "fingerprint": "7y5WDQllCuyzj32D",
        "funding": "credit",
        "last4": "4242",
        "metadata": {},
        "name": null,
        "tokenization_method": null,
        "type": "Visa"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/{stripe-customer-id}/cards",
    "count": 1
  },
  "default_card": "card_Bb4A2szGLfgwJe",
  "subscription": {
    "id": "sub_Bb4AOCnRZzV80I",
    "object": "subscription",
    "application_fee_percent": null,
    "billing": "charge_automatically",
    "cancel_at_period_end": false,
    "canceled_at": null,
    "created": 1508235068,
    "current_period_end": 1510827068,
    "current_period_start": 1508235068,
    "customer": "{stripe-customer-id}",
    "discount": null,
    "ended_at": null,
    "items": {
      "object": "list",
      "data": [
        {
          "id": "si_0BDs2SVZJqDRzwdrOx7KJDjP",
          "object": "subscription_item",
          "created": 1508235068,
          "metadata": {},
          "plan": {
            "id": "personal-9",
            "object": "plan",
            "amount": 900,
            "created": 1370600314,
            "currency": "gbp",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Personal",
            "statement_descriptor": null,
            "trial_period_days": 30,
            "statement_description": null
          },
          "quantity": 1
        }
      ],
      "has_more": false,
      "total_count": 1,
      "url": "/v1/subscription_items?subscription=sub_Bb4AOCnRZzV80I",
      "count": 1
    },
    "livemode": false,
    "metadata": {},
    "plan": {
      "id": "personal-9",
      "object": "plan",
      "amount": 900,
      "created": 1370600314,
      "currency": "gbp",
      "interval": "month",
      "interval_count": 1,
      "livemode": false,
      "metadata": {},
      "name": "Personal",
      "statement_descriptor": null,
      "trial_period_days": 30,
      "statement_description": null
    },
    "quantity": 1,
    "start": 1508235068,
    "status": "trialing",
    "tax_percent": null,
    "trial_end": 1510827068,
    "trial_start": 1508235068
  },
  "active_card": {
    "id": "card_Bb4A2szGLfgwJe",
    "object": "card",
    "address_city": null,
    "address_country": null,
    "address_line1": null,
    "address_line1_check": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": null,
    "brand": "Visa",
    "country": "US",
    "customer": "{stripe-customer-id}",
    "cvc_check": "pass",
    "dynamic_last4": null,
    "exp_month": 12,
    "exp_year": 2022,
    "fingerprint": "7y5WDQllCuyzj32D",
    "funding": "credit",
    "last4": "4242",
    "metadata": {},
    "name": null,
    "tokenization_method": null,
    "type": "Visa"
  }
}